app/controllers/faixa_de_descontos_controller.rb

  def index
    @faixa_de_descontos = FaixaDeDescontos.paginate( :page => @page, :per_page => @per_page)
---
SELECT * FROM "faixas_de_desconto"