app/controllers/item_pedidos_controller.rb

  def create
    @pedido = Pedido.find(params[:id])
---
SELECT "item_pedidos".id FROM "item_pedidos" WHERE ("item_pedidos"."pedido_id" = 3) LIMIT 1