app/controllers/item_pedidos_controller.rb

SELECT * FROM "item_pedidos"
---
  def index
    @item_pedidos = ItemPedido.all

SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 2)
---
  def show
    @item_pedido = ItemPedido.find(params[:id])

INSERT INTO "item_pedidos" ("valor_tabela", "created_at", "produto_id", "pedido_id", "valor_venda", "updated_at", "desconto", "quantidade") VALUES(10.2, '2009-05-20 17:03:40.401083', 2, 3, 10.0, '2009-05-20 17:03:40.401083', NULL, 1.0) RETURNING "id"
---
  def create
    @item_pedido = ItemPedido.new(params[:item_pedido])
    @item_pedido.valor_tabela = @item_pedido.produto.valor_normal

    respond_to do |format|
      if @item_pedido.save

SELECT * FROM "produtos" LIMIT 1
---
  def load_produtos
    @produtos = Produto.all.collect { |p| [p.descricao , p.id] }