app/controllers/pedidos_controller.rb

  def index
    @pedidos = Pedido.all
---
SELECT * FROM "pedidos"

  def show
    @pedido = Pedido.find(params[:id])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 2)

  def edit
    @pedido = Pedido.find(params[:id])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 1)

  def create
    @pedido = Pedido.new(params[:pedido])
    @pedido.operador_id = 1 # Deverá vir na session (lembrar de arumar depois)
    respond_to do |format|
      if @pedido.save
---
INSERT INTO "pedidos" ("funcionario_estorno_id", "tipo", "comprador", "data", "minuta_id", "estorno", "created_at", "preco_especial", "autorizador_id", "funcionario_id", "preco_tabela", "nome_comprador", "comissao_telemarketing", "autorizador_desconto_id", "updated_at", "plano_de_pagamento", "entrega", "programacao", "cliente_id", "valor", "desconto", "endereco_entrega", "area_id", "desconto_complementar", "oficial", "observacao", "operador_id", "comissao_vendedor", "operador_estorno_id", "previsao_entrega", "vendedor_id", "registro", "empresa_id", "status", "especial", "acrescimo", "transportadora_id", "telemarketing_id", "venda_externa") VALUES(NULL, 't', E'', '2009-05-15', NULL, '2009-05-15', '2009-05-15 13:12:19.644317', NULL, NULL, 1, NULL, NULL, NULL, NULL, '2009-05-15 13:12:19.644317', E'', '2009-05-15', '2009-05-15', 1, NULL, NULL, E'', NULL, NULL, NULL, E'', NULL, NULL, NULL, '2009-05-15', NULL, '2009-05-15', NULL, E'', 'f', NULL, NULL, NULL, 'f') RETURNING "id"

  def update
    @pedido = Pedido.find(params[:id])

    respond_to do |format|
      if @pedido.update_attributes(params[:pedido])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 16)
UPDATE "pedidos" SET "observacao" = E'', "updated_at" = '2009-05-17 12:36:30.120521', "especial" = 'f', "tipo" = E'E', "endereco_entrega" = E'', "programacao" = '2009-01-01', "comprador" = E'', "venda_externa" = 'f' WHERE "id" = 1

  def aprovar
    @pedido = Pedido.find(params[:id])
    @pedido.aprovar
    respond_to do |format|
      if @pedido.save
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 2)
UPDATE "pedidos" SET "updated_at" = '2009-05-20 12:48:48.921382', "entrega" = '2009-05-20 09:48:48.915408' WHERE "id" = 2