app/controllers/pedidos_controller.rb

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def index

 	@pedidos = Pedido.find(:all, :include => [:cliente], :offset => params[:start], :limit => params[:limit] )