app/controllers/produtos_controller.rb

SELECT * FROM "produtos"
---
  def index
    @produtos = Produto.all

SELECT * FROM "produtos" WHERE ("produtos"."id" = 2)
---
  def show
    @produto = Produto.find(params[:id])

INSERT INTO "produtos" ("kit", "created_at", "cor_id", "ipi", "funcionario_id", "cadastro_custo", "preco_normal_zona1", "updated_at", "valor_normal", "classe_id", "situacao_tributaria", "descricao_nota_fiscal", "grupo_id", "cod_emissao_nota_fiscal", "preco_minimo_nota_fiscal", "preco_especial_zona1", "emissao_relatorio", "valor_especial", "classificacao_fiscal", "custo", "descricao", "status", "peso_liquido") VALUES(NULL, '2009-05-20 16:57:25.481266', NULL, NULL, NULL, NULL, NULL, '2009-05-20 16:57:25.481266', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, E'teste', NULL, NULL) RETURNING "id"
---
  def create
    @produto = Produto.new(params[:produto])

    respond_to do |format|
      if @produto.save